Samael312/ESPKI/Firmware/sdkconfig.defaults
# =============================================================
# Kiconex Box Lite — sdkconfig.defaults
# Valores por defecto para ESP32-WROVER-IE
# =============================================================

# --- Target -------------------------------------------------
CONFIG_IDF_TARGET="esp32"

# --- Flash --------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# --- Partition table ----------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# --- PSRAM --------------------------------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=n
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# --- WiFi ---------------------------------------------------
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE_DYNAMIC=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y

# --- MQTT (esp-mqtt) ----------------------------------------
CONFIG_MQTT_USE_CUSTOM_CONFIG=y
CONFIG_MQTT_TASK_STACK_SIZE=16384
CONFIG_MQTT_BUFFER_SIZE=8192
CONFIG_MQTT_OUTBOX_EXPIRED_TIMEOUT_MS=60000

# --- Watchdog -----------------------------------------------
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=120
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y

# --- Logging ------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
CONFIG_LOG_COLORS=y

# --- NVS ----------------------------------------------------
CONFIG_NVS_ASSERT_ERROR_CHECK=y

# --- Heap ---------------------------------------------------
CONFIG_HEAP_CORRUPTION_DETECTION_LIGHT=y

# --- Stack sizes --------------------------------------------
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096

# --- FreeRTOS -----------------------------------------------
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_HZ=100
CONFIG_SYSVIEW_ENABLE=y
CONFIG_SYSVIEW_BUF_SIZE=65536
CONFIG_APPTRACE_ENABLE=y
CONFIG_APPTRACE_DEST_JTAG=y
